import { ICity } from '@shared/models/city.interface';

export const cities: ICity[] =
  [
    {
      "name": "ОНЛАЙН",
      "code": 0,
      "region": "ОНЛАЙН"
    },
    {
      "category": "Місто",
      "name": "КИЇВ",
      "code": 1,
      "region": "КИЇВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ЛЬВІВ",
      "code": 2,
      "region": "ЛЬВІВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ВІННИЦЯ",
      "code": 510100000,
      "region": "ВІННИЦЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ЖИТОМИР",
      "code": 510111111,
      "region": "ЖИТОМИРСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ЗАПОРІЖЖЯ",
      "code": 510222222,
      "region": "ЗАПОРІЗЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ОДЕСА",
      "code": 5110200000,
      "region": "ОДЕСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "РІВНЕ",
      "code": 5610100000,
      "region": "РІВНЕНСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ТЕРНОПІЛЬ",
      "code": 6110100000,
      "region": "ТЕРНОПІЛЬСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ЛУЦЬК",
      "code": 710100000,
      "region": "ВОЛИНСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "УЖГОРОД",
      "code": 2110100000,
      "region": "ЗАКАРПАТСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "МУКАЧЕВО",
      "code": 2110400000,
      "region": "ЗАКАРПАТСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ІВАНО-ФРАНКІВСЬК",
      "code": 2610100000,
      "region": "ІВАНО-ФРАНКІВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "БІЛА ЦЕРКВА",
      "code": 3210300000,
      "region": "КИЇВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "БОРИСПІЛЬ",
      "code": 3210500000,
      "region": "КИЇВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ВИШГОРОД",
      "code": 3221810100,
      "region": "КИЇВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ВИШНЕВЕ",
      "code": 3222410600,
      "region": "КИЇВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "МИКОЛАЇВ",
      "code": 4623010100,
      "region": "ЛЬВІВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "КАМ'ЯНЕЦЬ-ПОДІЛЬСЬКИЙ",
      "code": 6810400000,
      "region": "ХМЕЛЬНИЦЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "КРИВИЙ РІГ",
      "code": 6810400001,
      "region": "ДНІПРОПЕТРОВСЬКА ОБЛАСТЬ"
    },
    {
      "category": "Місто",
      "name": "ЧЕРНІВЦІ",
      "code": 7310100000,
      "region": "ЧЕРНІВЕЦЬКА ОБЛАСТЬ"
    }
  ]
